solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/drivers/fsl_sdadc.h
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef FSL_SDADC_H_
#define FSL_SDADC_H_

#include "fsl_common.h"

/*!
 * @addtogroup sdadc
 * @{
 */

/******************************************************************************
 * Definitions
 ******************************************************************************/
/*! @name Driver version */
/*!
 * @{
 */
/*! @brief SDADC driver version 2.0.1. */
#define FSL_SDADC_DRIVER_VERSION (MAKE_VERSION(2, 0, 1))
/*!
 * @}
 */

/*! @brief Macros are used to configure decimator volume. */
#define SDADC_DECIMATOR_VOL_CTRL_P_MASK(offset) \
    (uint32_t)((uint32_t)SDADC_DECIMATOR_CTL_2_VOL_CTRL_P_0_MASK << ((uint32_t)offset))
#define SDADC_DECIMATOR_VOL_CTRL_P_SHIFT(offset) \
    (uint32_t)((uint32_t)SDADC_DECIMATOR_CTL_2_VOL_CTRL_P_0_SHIFT + ((uint32_t)offset))
#define SDADC_DECIMATOR_VOL_CTRL_P(volume, offset)                                    \
    (((uint32_t)(((uint32_t)(volume)) << SDADC_DECIMATOR_VOL_CTRL_P_SHIFT(offset))) & \
     SDADC_DECIMATOR_VOL_CTRL_P_MASK(offset))

#define SDADC_DECIMATOR_VOL_CTRL_N_MASK(offset) \
    (uint32_t)((uint32_t)SDADC_DECIMATOR_CTL_2_VOL_CTRL_N_0_MASK << ((uint32_t)offset))
#define SDADC_DECIMATOR_VOL_CTRL_N_SHIFT(offset) \
    (uint32_t)((uint32_t)SDADC_DECIMATOR_CTL_2_VOL_CTRL_N_0_SHIFT + ((uint32_t)offset))
#define SDADC_DECIMATOR_VOL_CTRL_N(volume, offset)                                    \
    (((uint32_t)(((uint32_t)(volume)) << SDADC_DECIMATOR_VOL_CTRL_N_SHIFT(offset))) & \
     SDADC_DECIMATOR_VOL_CTRL_N_MASK(offset))

/*! @brief Macros are used to configure decimator sample rate. */
#define SDADC_DECIMATOR_SET_SPEED_P_MASK(offset) \
    (uint32_t)((uint32_t)SDADC_DECIMATOR_CTL_4_SET_SPEED_P_0_MASK << ((uint32_t)offset * 4UL))
#define SDADC_DECIMATOR_SET_SPEED_P_SHIFT(offset) \
    (uint32_t)((uint32_t)SDADC_DECIMATOR_CTL_4_SET_SPEED_P_0_SHIFT + ((uint32_t)offset * 4UL))
#define SDADC_DECIMATOR_SET_SPEED_P(rate, offset)                                    \
    (((uint32_t)(((uint32_t)(rate)) << SDADC_DECIMATOR_SET_SPEED_P_SHIFT(offset))) & \
     SDADC_DECIMATOR_SET_SPEED_P_MASK(offset))

#define SDADC_DECIMATOR_SET_SPEED_N_MASK(offset) \
    (uint32_t)((uint32_t)SDADC_DECIMATOR_CTL_4_SET_SPEED_N_0_MASK << ((uint32_t)offset * 4UL))
#define SDADC_DECIMATOR_SET_SPEED_N_SHIFT(offset) \
    (uint32_t)((uint32_t)SDADC_DECIMATOR_CTL_4_SET_SPEED_N_0_SHIFT + ((uint32_t)offset * 4UL))
#define SDADC_DECIMATOR_SET_SPEED_N(rate, offset)                                    \
    (((uint32_t)(((uint32_t)(rate)) << SDADC_DECIMATOR_SET_SPEED_N_SHIFT(offset))) & \
     SDADC_DECIMATOR_SET_SPEED_N_MASK(offset))

/*! @brief Macros are used to configure the dither amplitude. */
#define SDADC_ADC_CTL_2_SET_DITHER_MASK(offset) \
    (uint32_t)((uint32_t)SDADC_ADC_CTL_2_SET_DITHER3_MASK << ((3UL - (uint32_t)offset) * 4UL))
#define SDADC_ADC_CTL_2_SET_DITHER_SHIFT(offset) \
    (uint32_t)((uint32_t)SDADC_ADC_CTL_2_SET_DITHER3_SHIFT + ((3UL - (uint32_t)offset) * 4UL))
#define SDADC_ADC_CTL_2_SET_DITHER(val, offset)                                    \
    (((uint32_t)(((uint32_t)(val)) << SDADC_ADC_CTL_2_SET_DITHER_SHIFT(offset))) & \
     SDADC_ADC_CTL_2_SET_DITHER_MASK(offset))

/*! @brief Macros are used to configure FIFO watermark. */
#define SDADC_FIFO_WATERMARK_CTL_P_MASK(offset) \
    (uint32_t)((uint32_t)SDADC_FIFO_WATERMARK_CTL_WATERMARK_0_P_MASK << ((uint32_t)offset * 8UL))
#define SDADC_FIFO_WATERMARK_CTL_P_SHIFT(offset) \
    (uint32_t)((uint32_t)SDADC_FIFO_WATERMARK_CTL_WATERMARK_0_P_SHIFT + ((uint32_t)offset * 8UL))
#define SDADC_FIFO_WATERMARK_CTL_P(watermark, offset)                                    \
    (((uint32_t)(((uint32_t)(watermark)) << SDADC_FIFO_WATERMARK_CTL_P_SHIFT(offset))) & \
     SDADC_FIFO_WATERMARK_CTL_P_MASK(offset))

#define SDADC_FIFO_WATERMARK_CTL_N_MASK(offset) \
    (uint32_t)((uint32_t)SDADC_FIFO_WATERMARK_CTL_WATERMARK_0_N_MASK << ((uint32_t)offset * 8UL))
#define SDADC_FIFO_WATERMARK_CTL_N_SHIFT(offset) \
    (uint32_t)((uint32_t)SDADC_FIFO_WATERMARK_CTL_WATERMARK_0_N_SHIFT + ((uint32_t)offset * 8UL))
#define SDADC_FIFO_WATERMARK_CTL_N(watermark, offset)                                    \
    (((uint32_t)(((uint32_t)(watermark)) << SDADC_FIFO_WATERMARK_CTL_N_SHIFT(offset))) & \
     SDADC_FIFO_WATERMARK_CTL_N_MASK(offset))

/*! @brief Macros are used for FIFO operations. */
#define SDADC_FIFO_WATERMARK_STATUS_MASK  0xFFU
#define SDADC_FIFO_WATERMARK_STATUS_SHIFT SDADC_FIFO_WATERMARK_ERROR_ST_WM_0_P_ST_SHIFT
#define SDADC_FIFO_FULL_INT_STATUS_MASK   0xFF00U
#define SDADC_FIFO_FULL_INT_STATUS_SHIFT  SDADC_FIFO_WATERMARK_ERROR_ST_ERR_0_P_SHIFT
#define SDADC_FIFO_MASK                   SDADC_FIFO_0_P_FIFO_0_P_MASK
#define SDADC_FIFO_SHIFT                  SDADC_FIFO_0_P_FIFO_0_P_SHIFT
#define SDADC_FIFO_ENTRIES_AVAIL_MASK     SDADC_FIFO_ENTRIES_AVAIL_0_FIFO_0_P_AVAIL_MASK
#define SDADC_FIFO_DEPTH                  (16U)
#define SDADC_FIFO_WIDTH                  (4U)

/*!
 * @brief This enumeration provides the mask for the SDADC channel P-Side and N-Side FIFO full interrupt enable/disable.
 */
enum _sdadc_fifo_int_enable
{
    kSDADC_Channel0_PSide_FifoFullIntEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_ERR_0_P_EN_MASK,
    kSDADC_Channel0_NSide_FifoFullIntEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_ERR_0_N_EN_MASK,
    kSDADC_Channel1_PSide_FifoFullIntEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_ERR_1_P_EN_MASK,
    kSDADC_Channel1_NSide_FifoFullIntEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_ERR_1_N_EN_MASK,
    kSDADC_Channel2_PSide_FifoFullIntEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_ERR_2_P_EN_MASK,
    kSDADC_Channel2_NSide_FifoFullIntEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_ERR_2_N_EN_MASK,
    kSDADC_Channel3_PSide_FifoFullIntEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_ERR_3_P_EN_MASK,
    kSDADC_Channel3_NSide_FifoFullIntEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_ERR_3_N_EN_MASK,
};

/*!
 * @brief This enumeration provides the mask for the SDADC channel P-Side and N-Side FIFO watermark enable/disable.
 */
enum _sdadc_fifo_watermark_enable
{
    kSDADC_Channel0_PSide_FifoWatermarkEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_WM_0_P_EN_MASK,
    kSDADC_Channel0_NSide_FifoWatermarkEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_WM_0_N_EN_MASK,
    kSDADC_Channel1_PSide_FifoWatermarkEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_WM_1_P_EN_MASK,
    kSDADC_Channel1_NSide_FifoWatermarkEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_WM_1_N_EN_MASK,
    kSDADC_Channel2_PSide_FifoWatermarkEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_WM_2_P_EN_MASK,
    kSDADC_Channel2_NSide_FifoWatermarkEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_WM_2_N_EN_MASK,
    kSDADC_Channel3_PSide_FifoWatermarkEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_WM_3_P_EN_MASK,
    kSDADC_Channel3_NSide_FifoWatermarkEnable = SDADC_FIFO_WATERMARK_ERROR_CTL_WM_3_N_EN_MASK,
};

/*!
 * @brief This enumeration provides the mask for the SDADC channel P-Side and N-Side FIFO full interrupt status flag.
 */
enum _sdadc_fifo_int_status_flag
{
    kSDADC_Channel0_PSide_FifoFullIntStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_ERR_0_P_MASK,
    kSDADC_Channel0_NSide_FifoFullIntStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_ERR_0_N_MASK,
    kSDADC_Channel1_PSide_FifoFullIntStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_ERR_1_P_MASK,
    kSDADC_Channel1_NSide_FifoFullIntStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_ERR_1_N_MASK,
    kSDADC_Channel2_PSide_FifoFullIntStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_ERR_2_P_MASK,
    kSDADC_Channel2_NSide_FifoFullIntStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_ERR_2_N_MASK,
    kSDADC_Channel3_PSide_FifoFullIntStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_ERR_3_P_MASK,
    kSDADC_Channel3_NSide_FifoFullIntStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_ERR_3_N_MASK,
};

/*!
 * @brief This enumeration provides the mask for the SDADC channel P-Side and N-Side FIFO watermark status flag.
 */
enum _sdadc_fifo_watermark_status_flag
{
    kSDADC_Channel0_PSide_FifoWatermarkStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_WM_0_P_ST_MASK,
    kSDADC_Channel0_NSide_FifoWatermarkStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_WM_0_N_ST_MASK,
    kSDADC_Channel1_PSide_FifoWatermarkStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_WM_1_P_ST_MASK,
    kSDADC_Channel1_NSide_FifoWatermarkStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_WM_1_N_ST_MASK,
    kSDADC_Channel2_PSide_FifoWatermarkStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_WM_2_P_ST_MASK,
    kSDADC_Channel2_NSide_FifoWatermarkStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_WM_2_N_ST_MASK,
    kSDADC_Channel3_PSide_FifoWatermarkStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_WM_3_P_ST_MASK,
    kSDADC_Channel3_NSide_FifoWatermarkStatusFlag = SDADC_FIFO_WATERMARK_ERROR_ST_WM_3_N_ST_MASK,
};

/*!
 * @brief This enumeration provides the selection of the SDADC channel mode.
 */
typedef enum _sdadc_channel_mode
{
    kSDADC_SingleEnd_Mode    = 0U, /*!< Single-end mode. */
    kSDADC_Differential_Mode = 1U, /*!< Differential mode. */
} sdadc_channel_mode_t;

/*!
 * @brief This enumeration provides the selection of the SDADC channel number.
 */
typedef enum _sdadc_channel_number
{
    kSDADC_Channel0 = 0U, /*!< SDADC channel 0. */
    kSDADC_Channel1 = 1U, /*!< SDADC channel 1. */
    kSDADC_Channel2 = 2U, /*!< SDADC channel 2. */
    kSDADC_Channel3 = 3U, /*!< SDADC channel 3. */
} sdadc_channel_number_t;

/*!
 * @brief This enumeration provides the selection of the SDADC channel type.
 */
typedef enum _sdadc_channel_type
{
    kSDADC_Channel_NSide_Type     = 0x01U, /*!< N-side selected. */
    kSDADC_Channel_PSide_Type     = 0x10U, /*!< P-side selected. */
    kSDADC_Channel_NandPSide_Type = 0x11U, /*!< N- and P-side selected. */
} sdadc_channel_type_t;

/*!
 * @brief This enumeration provides the selection of the SDADC decimator sample rate.
 */
typedef enum _sdadc_decimator_sample_rate
{
    kSDADC_DecimatorSampleRate48kHz = 0x0U, /*!< 48kHz decimator sample rate. */
    kSDADC_DecimatorSampleRate32kHz = 0x1U, /*!< 32kHz decimator sample rate. */
    kSDADC_DecimatorSampleRate16kHz = 0x2U, /*!< 16kHz decimator sample rate. */
} sdadc_decimator_sample_rate_t;

/*!
 * @brief This enumeration provides the selection of the SDADC LDO drive capability.
 */
typedef enum _sdadc_ldo_drive_capability
{
    kSDADC_LdoLowPower  = 0x0U, /*!< To drive 1 single-end mode or 1 differential mode SDADC. */
    kSDADC_LdoHighPower = 0x1U, /*!< To drive more than 1 SDADC */
} sdadc_ldo_drive_capability_t;

/*!
 * @brief This enumeration provides the selection of the SDADC reference mode.
 *
 * @details The SDADC reference module has four modes, these modes are controlled via REF_CTL register
 * 'fast_ref_enable' and 'pwr_fast_ref_enable' bitfields.
 *      1.Retain mode: pwr_fast_ref_enable = 0b, fast_ref_enable = 0b.
 *      2.Low noise mode: pwr_fast_ref_enable = 0b, fast_ref_enable = 1b.
 *      3.Low power mode: pwr_fast_ref_enable = 1b, fast_ref_enable = 0b.
 *      4.Fast charge mode: pwr_fast_ref_enable = 1b, fast_ref_enable = 1b.
 */
typedef enum _sdadc_ref_mode
{
    kSDADC_RefRetainMode     = 0x0U, /*!< Reference in retain mode. */
    kSDADC_RefLowNoiseMode   = 0x1U, /*!< Reference in low noise mode. */
    kSDADC_RefLowPowerMode   = 0x2U, /*!< Reference in low power mode. */
    kSDADC_RefFastChargeMode = 0x3U, /*!< Reference in fast charge mode. */
} sdadc_ref_mode_t;

/*!
 * @brief This enumeration provides the selection of the SDADC FIFO write or/and read operation.
 */
typedef enum _sdadc_fifo_reset_operation
{
    kSDADC_FifoWriteReset        = 0x1U, /*!< FIFO write reset. */
    kSDADC_FifoReadReset         = 0x2U, /*!< FIFO read reset. */
    kSDADC_FifoWriteAndReadReset = 0x3U, /*!< FIFO write and read reset. */
} sdadc_fifo_reset_operation_t;

/*!
 * @brief This structure is used to configure the decimator volume (gain).
 *
 * @note The gain setting is not applicable for the channel N-Side when executing the differential mode. For the
 * specific gain setting value please refer to the reference manual.
 */
typedef struct _sdadc_volume
{
    uint8_t pSideVolume; /*!< Sets the gain for the P-Side decimator. */
    uint8_t nSideVolume; /*!< Sets the gain for the N-Side decimator. */
} sdadc_volume_control_t;

/*!
 * @brief This structure is used to configure the decimator sample rate.
 */
typedef struct _sdadc_sample_rate
{
    sdadc_decimator_sample_rate_t pSideSampleRate; /*!< Sets the P-Side decimator sample rate. */
    sdadc_decimator_sample_rate_t nSideSampleRate; /*!< Sets the N-Side decimator sample rate. */
} sdadc_sample_rate_t;

/*!
 * @brief This structure is used to configure the FIFO watermark.
 *
 * @note In the differential mode, the bitstream is converted to 24bit data (FIFO_x_P[23:0]) by P-Side decimator,
 * the output of N-Side decimator (FIFO_x_N[23:0]) is not valid.
 */
typedef struct _sdadc_watermark
{
    uint8_t pSideWatermark; /*!< Sets the channel N-Side FIFO watermark. */
    uint8_t nSideWatermark; /*!< Sets the channel P-Side FIFO watermark. */
} sdadc_watermark_t;

/*!
 * @brief This structure is used to configure the SDADC channels.
 */
typedef struct _sdadc_channel_config
{
    sdadc_channel_mode_t mode;      /*!< Sets channel mode. */
    sdadc_channel_number_t number;  /*!< Sets channel number. */
    sdadc_channel_type_t type;      /*!< Sets channel type. */

