solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/drivers/fsl_sdadc.h
    sdadc_volume_control_t volume;  /*!< Sets N- and P-side decimator volume. */
    sdadc_sample_rate_t samplerate; /*!< Sets N- and P-side decimator samplerate. */
    sdadc_watermark_t watermark;    /*!< Sets N- and P-side FIFO watermark. */

    bool enableDacCompensation;     /*!< Decides whether to enable the compensation feature for the ADCp[3:0] or/and
                                    ADCn[3:0] in the single-end mode, is used to avoid large data-dependent ripple
                                    on LDO output which will impact the ADC performance. */
    bool enableDCLoop;              /*!< In some cases of the single-end mode, the microphone output is connected
                                    directly to ADC input without the coupling capacitor, DC Loop is activated to
                                    regulate input common-mode voltage of the ADCp[3:0] or/and ADCn[3:0]. In the
                                    single-end mode, there is the possibility to connect MEMS or JFET microphone
                                    directly to the input (DC-coupled). In this configuration, DC Loop mode needs
                                    to be activated to establish the correct common mode input voltage level at
                                    the input pin. The DC Loop function should disabled in the differential mode. */
    bool enableDcFilter;            /*!< Decides whether to enable the decimator DC Filter to remove DC components.*/
    bool enablePolarityInvert; /*!< Decides whether to enable the polarity invert function, for example: if the input to
                               ADC is a pure sinus signal, then if the polarity invert is enabled, the decimation output
                               will be a sinus signal 180 out of phase with the input. */
} sdadc_channel_config_t;

/*!
 * @brief This structure is used to configure the SDADC module.
 */
typedef struct _sdadc_config
{
    uint8_t channelCount;                  /*!< Indicates how many channels to execute the conversion. */
    sdadc_channel_config_t *channelConfig; /*!< SDADC channels configuration. */
} sdadc_config_t;

/*!
 * @brief This structure is used to construct channel groups.
 */
typedef struct _sdadc_channel_group
{
    sdadc_channel_number_t number; /*!< Channel number. */
    sdadc_channel_type_t type;     /*!< Channel type. */
} sdadc_channel_group;

/******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name SDADC initialization and de-initialization.
 * @{
 */
/*!
 * @brief This function is used to get available predefined configurations for the SDADC initialization.
 *
 * @param config Pointer to the SDADC configuration structure, please refer to @ref sdadc_config_t for details.
 */
void SDADC_GetDefaultConfig(sdadc_config_t *config);

/*!
 * @brief This function is used to initialize the SDADC.
 *
 * @param base SDADC peripheral base address.
 * @param config Pointer to the SDADC configuration structure, please refer to @ref sdadc_config_t for details.
 */
void SDADC_Init(SDADC_Type *base, const sdadc_config_t *config);

/*!
 * @brief This function is used to de-initialize the SDADC.
 *
 * @param base SDADC peripheral base address.
 * @param config Pointer to the SDADC configuration structure, please refer to @ref sdadc_config_t for details.
 */
void SDADC_Deinit(SDADC_Type *base, const sdadc_config_t *config);
/*!
 * @}
 */

/*!
 * @name SDADC channel modulator, reference, and LDO configuration.
 * @{
 */
/*!
 * @brief This function is used to power up the SDADC in the initialization state.
 *
 * @param base SDADC peripheral base address.
 * @param config Pointer to the SDADC configuration structure, please refer to @ref sdadc_config_t for details.
 * @param clock Core clock frequency with Hz.
 */
void SDADC_DoInitPowerUp(SDADC_Type *base, sdadc_config_t *config, uint32_t clock);

/*!
 * @brief This function is used to enable or disable SDADC specific channel's P-Side or/and N-Side sigma-delta
 * modulator power.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param type channel type, refer @ref sdadc_channel_type_t for details.
 * @param enable Decides whether to enable or disable.
 * - @b true Enable
 * - @b false Disable
 */
static inline void SDADC_ControlModulatorPowerEnable(SDADC_Type *base,
                                                     sdadc_channel_number_t number,
                                                     sdadc_channel_type_t type,
                                                     bool enable)
{
    if (enable)
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->ADC_CTL_0 |= (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_ADCP_POWER_ENABLE_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->ADC_CTL_0 |= (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_ADCN_POWER_ENABLE_SHIFT));
        }
        else
        {
            base->ADC_CTL_0 |= ((0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_ADCP_POWER_ENABLE_SHIFT)) |
                                (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_ADCN_POWER_ENABLE_SHIFT)));
        }
    }
    else
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->ADC_CTL_0 &= ~(0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_ADCP_POWER_ENABLE_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->ADC_CTL_0 &= ~(0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_ADCN_POWER_ENABLE_SHIFT));
        }
        else
        {
            base->ADC_CTL_0 &= ~((0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_ADCP_POWER_ENABLE_SHIFT)) |
                                 (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_ADCN_POWER_ENABLE_SHIFT)));
        }
    }
}

/*!
 * @brief This function is used to enable or disable the reference power.
 *
 * @param base SDADC peripheral base address.
 * @param enable Indicates enable or disable the reference power.
 * - @b true Enable
 * - @b false Disable
 */
static inline void SDADC_ControlReferencePowerEnable(SDADC_Type *base, bool enable)
{
    if (enable)
    {
        base->REF_CTL |= SDADC_REF_CTL_REF_POWER_ENABLE_MASK;
    }
    else
    {
        base->REF_CTL &= ~SDADC_REF_CTL_REF_POWER_ENABLE_MASK;
    }
}

/*!
 * @brief This function is used to configure the reference mode.
 *
 * @note Setting the reference to fast charge mode is mainly used during startup where fast startup
 * is required, the current consumption in this mode is the largest, so, it is recommended to switch
 * to other modes to minimize current consumption. If the ADC works on the single-end mode, recommend
 * switching to the low-noise mode, if the ADC works on the differential mode, recommend switching to
 * the retain mode.
 *
 * @param base SDADC peripheral base address.
 * @param referenceMode Reference mode to be configured, see @ref sdadc_ref_mode_t for details.
 */
static inline void SDADC_ConfigureReferenceMode(SDADC_Type *base, sdadc_ref_mode_t referenceMode)
{
    base->REF_CTL =
        ((base->REF_CTL & (~(SDADC_REF_CTL_FAST_REF_ENABLE_MASK | SDADC_REF_CTL_PWR_FAST_REF_ENABLE_MASK))) |
         (((((uint32_t)referenceMode & 0x2U) != 0UL) ? SDADC_REF_CTL_PWR_FAST_REF_ENABLE_MASK : 0U) |
          ((((uint32_t)referenceMode & 0x1U) != 0UL) ? SDADC_REF_CTL_FAST_REF_ENABLE_MASK : 0U)));
}

/*!
 * @brief This function is used to enable or disable the LDO power.
 *
 * @param base SDADC peripheral base address.
 * @param enable Indicates enable or disable the LDO power.
 * - @b true Enable
 * - @b false Disable
 */
static inline void SDADC_ControlLdoPowerEnable(SDADC_Type *base, bool enable)
{
    if (enable)
    {
        base->LDO_CTL |= SDADC_LDO_CTL_LDO_POWER_ENABLE_MASK;
    }
    else
    {
        base->LDO_CTL &= ~SDADC_LDO_CTL_LDO_POWER_ENABLE_MASK;
    }
}

/*!
 * @brief This function is used to configure the drive capability.
 *
 * @param base SDADC peripheral base address.
 * @param capability SDADC LDO drive capability to be set, see @ref sdadc_ldo_drive_capability_t for details.
 */
static inline void SDADC_ConfigureLdoDriveCapability(SDADC_Type *base, sdadc_ldo_drive_capability_t capability)
{
    base->LDO_CTL = ((base->LDO_CTL & (~SDADC_LDO_CTL_LDO_SETTING_MASK)) | (SDADC_LDO_CTL_LDO_SETTING(capability)));
}
/*!
 * @}
 */

/*!
 * @name SDADC channel mode, DAC compensation, modulator DC Loop, decimator DC Filter configuration.
 * @{
 */
/*!
 * @brief This function is used to configure the channel mode.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param mode channel mode, refer @ref sdadc_channel_mode_t for details.
 */
static inline void SDADC_ConfigureChannelMode(SDADC_Type *base,
                                              sdadc_channel_number_t number,
                                              sdadc_channel_mode_t mode)
{
    if (kSDADC_SingleEnd_Mode == mode)
    {
        base->ADC_CTL_1 &= ~(0x01UL << ((uint32_t)number + SDADC_ADC_CTL_1_DIFF_ENABLE_SHIFT));
    }
    else
    {
        base->ADC_CTL_1 |= (0x01UL << ((uint32_t)number + SDADC_ADC_CTL_1_DIFF_ENABLE_SHIFT));
    }
}

/*!
 * @brief This function is used to enable or disable the DAC compensation function.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param type channel type, refer @ref sdadc_channel_type_t for details.
 * @param enable Decides whether to enable or disable.
 * - @b true Enable
 * - @b false Disable
 */
static inline void SDADC_ControlDacCompensationEnable(SDADC_Type *base,
                                                      sdadc_channel_number_t number,
                                                      sdadc_channel_type_t type,
                                                      bool enable)
{
    if (enable)
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->ADC_CTL_0 |= (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_COMP_ADCP_ENABLE_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->ADC_CTL_0 |= (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_COMP_ADCN_ENABLE_SHIFT));
        }
        else
        {
            base->ADC_CTL_0 |= ((0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_COMP_ADCP_ENABLE_SHIFT)) |
                                (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_COMP_ADCN_ENABLE_SHIFT)));
        }
    }
    else
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->ADC_CTL_0 &= ~(0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_COMP_ADCP_ENABLE_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->ADC_CTL_0 &= ~(0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_COMP_ADCN_ENABLE_SHIFT));
        }
        else
        {
            base->ADC_CTL_0 &= ~((0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_COMP_ADCP_ENABLE_SHIFT)) |
                                 (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_COMP_ADCN_ENABLE_SHIFT)));
        }
    }
}

/*!
 * @brief This function is used to enable or disable the modulator DC Loop function.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param type channel type, refer @ref sdadc_channel_type_t for details.
 * @param enable Decides whether to enable or disable.
 * - @b true Enable
 * - @b false Disable
 */
static inline void SDADC_ControlModulatorDcLoopEnable(SDADC_Type *base,
                                                      sdadc_channel_number_t number,
                                                      sdadc_channel_type_t type,
                                                      bool enable)
{
    if (enable)
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->ADC_CTL_1 |= (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_1_DCLOOP_P_ANA_ENABLE_SHIFT));
            base->DC_LOOP_CTL_0 |= (0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_0_DCLOOP_P_ENABLE_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->ADC_CTL_1 |= (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_1_DCLOOP_N_ANA_ENABLE_SHIFT));
            base->DC_LOOP_CTL_0 |= (0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_0_DCLOOP_N_ENABLE_SHIFT));
        }
        else
        {
            base->ADC_CTL_1 |= ((0x1UL << ((uint32_t)number + SDADC_ADC_CTL_1_DCLOOP_P_ANA_ENABLE_SHIFT)) |
                                (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_1_DCLOOP_N_ANA_ENABLE_SHIFT)));
            base->DC_LOOP_CTL_0 |= ((0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_0_DCLOOP_P_ENABLE_SHIFT)) |
                                    (0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_0_DCLOOP_N_ENABLE_SHIFT)));
        }
    }
    else
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->ADC_CTL_1 &= ~(0x1UL << ((uint32_t)number + SDADC_ADC_CTL_1_DCLOOP_P_ANA_ENABLE_SHIFT));
            base->DC_LOOP_CTL_0 &= ~(0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_0_DCLOOP_P_ENABLE_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->ADC_CTL_1 &= ~(0x1UL << ((uint32_t)number + SDADC_ADC_CTL_1_DCLOOP_N_ANA_ENABLE_SHIFT));
            base->DC_LOOP_CTL_0 &= ~(0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_0_DCLOOP_N_ENABLE_SHIFT));
        }
        else
        {
            base->ADC_CTL_1 &= ~((0x1UL << ((uint32_t)number + SDADC_ADC_CTL_1_DCLOOP_P_ANA_ENABLE_SHIFT)) |
                                 (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_1_DCLOOP_N_ANA_ENABLE_SHIFT)));
            base->DC_LOOP_CTL_0 &= ~((0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_0_DCLOOP_P_ENABLE_SHIFT)) |
                                     (0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_0_DCLOOP_N_ENABLE_SHIFT)));
        }
    }
}

/*!
 * @brief This function is used to enable or disable the decimator DC Filter function.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param type channel type, refer @ref sdadc_channel_type_t for details.
 * @param enable Decides whether to enable or disable.
 * - @b true Enable
 * - @b false Disable
 */
static inline void SDADC_ControlDecimatorDcFilterEnable(SDADC_Type *base,
                                                        sdadc_channel_number_t number,
                                                        sdadc_channel_type_t type,
                                                        bool enable)
{
    if (enable)
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->DECIMATOR_CTL_0 |= (0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_DCFILTI_P_ENABLE_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->DECIMATOR_CTL_0 |= (0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_DCFILTI_N_ENABLE_SHIFT));
        }
        else
        {
            base->DECIMATOR_CTL_0 |= ((0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_DCFILTI_P_ENABLE_SHIFT)) |
                                      (0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_DCFILTI_N_ENABLE_SHIFT)));
        }
    }
    else
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->DECIMATOR_CTL_0 &= ~(0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_DCFILTI_P_ENABLE_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->DECIMATOR_CTL_0 &= ~(0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_DCFILTI_N_ENABLE_SHIFT));
        }
        else
        {
            base->DECIMATOR_CTL_0 &= ~((0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_DCFILTI_P_ENABLE_SHIFT)) |
                                       (0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_DCFILTI_N_ENABLE_SHIFT)));
        }
    }
}

/*!
 * @brief This function is used to enable or disable the decimator output invert.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param type channel type, refer @ref sdadc_channel_type_t for details.
 * @param enable Decides whether to enable or disable.
 * - @b true Enable
 * - @b false Disable
 */
static inline void SDADC_ControlDecimatorOutputInvertEnable(SDADC_Type *base,
                                                            sdadc_channel_number_t number,
                                                            sdadc_channel_type_t type,
                                                            bool enable)
{
    if (enable)
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->DECIMATOR_CTL_0 |= (0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_POL_INV_P_ENABLE_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->DECIMATOR_CTL_0 |= (0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_POL_INV_N_ENABLE_SHIFT));
        }
        else
        {
            base->DECIMATOR_CTL_0 |= ((0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_POL_INV_P_ENABLE_SHIFT)) |
                                      (0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_POL_INV_N_ENABLE_SHIFT)));
        }
    }
    else
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->DECIMATOR_CTL_0 &= ~(0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_POL_INV_P_ENABLE_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->DECIMATOR_CTL_0 &= ~(0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_POL_INV_N_ENABLE_SHIFT));
        }
        else
        {
            base->DECIMATOR_CTL_0 &= ~((0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_POL_INV_P_ENABLE_SHIFT)) |
                                       (0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_0_POL_INV_N_ENABLE_SHIFT)));
        }
    }
}

/*!
 * @brief This function is used to configure the decimator volume.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param type channel type, refer @ref sdadc_channel_type_t for details.
 * @param volume Volume level, see @ref sdadc_volume_control_t for details.
 */
static inline void SDADC_ConfigureDecimatorVolume(SDADC_Type *base,
                                                  sdadc_channel_number_t number,
                                                  sdadc_channel_type_t type,
                                                  sdadc_volume_control_t volume)
{
    uint8_t registerOffset = (uint32_t)number / 2U;
    uint8_t bitfieldOffset = (uint32_t)number % 2U * 16U;

