solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/drivers/fsl_sdadc.h
    if (type == kSDADC_Channel_PSide_Type)
    {
        (*(((uint32_t *)(&(base->DECIMATOR_CTL_2))) + registerOffset)) =
            (((*(((volatile uint32_t *)(&(base->DECIMATOR_CTL_2))) + registerOffset)) &
              (~(SDADC_DECIMATOR_VOL_CTRL_P_MASK(bitfieldOffset)))) |
             SDADC_DECIMATOR_VOL_CTRL_P(volume.pSideVolume, bitfieldOffset));
    }
    else if (type == kSDADC_Channel_NSide_Type)
    {
        (*(((uint32_t *)(&(base->DECIMATOR_CTL_2))) + registerOffset)) =
            (((*(((volatile uint32_t *)(&(base->DECIMATOR_CTL_2))) + registerOffset)) &
              (~(SDADC_DECIMATOR_VOL_CTRL_N_MASK(bitfieldOffset)))) |
             SDADC_DECIMATOR_VOL_CTRL_N(volume.nSideVolume, bitfieldOffset));
    }
    else
    {
        (*(((uint32_t *)(&(base->DECIMATOR_CTL_2))) + registerOffset)) =
            (((*(((volatile uint32_t *)(&(base->DECIMATOR_CTL_2))) + registerOffset)) &
              (~(SDADC_DECIMATOR_VOL_CTRL_P_MASK(bitfieldOffset) | SDADC_DECIMATOR_VOL_CTRL_N_MASK(bitfieldOffset)))) |
             (SDADC_DECIMATOR_VOL_CTRL_P(volume.pSideVolume, bitfieldOffset) |
              SDADC_DECIMATOR_VOL_CTRL_N(volume.nSideVolume, bitfieldOffset)));
    }
}

/*!
 * @brief This function is used to configure the decimator sample rate.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param type channel type, refer @ref sdadc_channel_type_t for details.
 * @param sampleRate Sample rate, see @ref sdadc_sample_rate_t for details.
 */
static inline void SDADC_ConfigureDecimatorSampleRate(SDADC_Type *base,
                                                      sdadc_channel_number_t number,
                                                      sdadc_channel_type_t type,
                                                      sdadc_sample_rate_t sampleRate)
{
    if (type == kSDADC_Channel_PSide_Type)
    {
        base->DECIMATOR_CTL_4 = ((base->DECIMATOR_CTL_4 & (~SDADC_DECIMATOR_SET_SPEED_P_MASK(number))) |
                                 SDADC_DECIMATOR_SET_SPEED_P(sampleRate.pSideSampleRate, number));
    }
    else if (type == kSDADC_Channel_NSide_Type)
    {
        base->DECIMATOR_CTL_4 = ((base->DECIMATOR_CTL_4 & (~SDADC_DECIMATOR_SET_SPEED_N_MASK(number))) |
                                 SDADC_DECIMATOR_SET_SPEED_N(sampleRate.nSideSampleRate, number));
    }
    else
    {
        base->DECIMATOR_CTL_4 =
            ((base->DECIMATOR_CTL_4 &
              (~(SDADC_DECIMATOR_SET_SPEED_P_MASK(number) | SDADC_DECIMATOR_SET_SPEED_N_MASK(number)))) |
             (SDADC_DECIMATOR_SET_SPEED_P(sampleRate.pSideSampleRate, number) |
              SDADC_DECIMATOR_SET_SPEED_N(sampleRate.nSideSampleRate, number)));
    }
}

/*!
 * @brief This function is used to set the dither amplitude.
 *
 * @details In the ADC conversion process, adding dither can improve the ADC dynamic performance, but too large a dither
 * will cause the input signal to overflow, the user needs to set the appropriate dither amplitude according to their
 * own needs.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param ditherAmplitude The dither amplitude that will be introduced, the range is from 000b to 111b, 000b means
 * disable the dither.
 */
static inline void SDADC_ConfigureDitherAmplitude(SDADC_Type *base,
                                                  sdadc_channel_number_t number,
                                                  uint8_t ditherAmplitude)
{
    base->ADC_CTL_2 = ((base->ADC_CTL_2 & (~SDADC_ADC_CTL_2_SET_DITHER_MASK(number))) |
                       (SDADC_ADC_CTL_2_SET_DITHER(ditherAmplitude, number)));
}
/*!
 * @}
 */

/*!
 * @name SDADC modulator, decimator, and modulator DC Loop reset and release reset.
 * @{
 */
/*!
 * @brief This function is used to reset or release reset for the SDADC specific channel's P-Side or N-Side sigma-delta
 * modulator.
 *
 * @note Needs to be reset for at least 15us after start-up, and then release the reset.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param type channel type, refer @ref sdadc_channel_type_t for details.
 * @param reset Indicates reset or release reset for the sigma-delta modulator.
 * - @b true Reset
 * - @b false Release reset
 */
static inline void SDADC_ControlModulatorReset(SDADC_Type *base,
                                               sdadc_channel_number_t number,
                                               sdadc_channel_type_t type,
                                               bool reset)
{
    if (reset)
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->ADC_CTL_0 &= ~(0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_RST_AN_ADCP_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->ADC_CTL_0 &= ~(0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_RST_AN_ADCN_SHIFT));
        }
        else
        {
            base->ADC_CTL_0 &= ~((0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_RST_AN_ADCP_SHIFT)) |
                                 (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_RST_AN_ADCN_SHIFT)));
        }
    }
    else
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->ADC_CTL_0 |= (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_RST_AN_ADCP_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->ADC_CTL_0 |= (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_RST_AN_ADCN_SHIFT));
        }
        else
        {
            base->ADC_CTL_0 |= ((0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_RST_AN_ADCP_SHIFT)) |
                                (0x1UL << ((uint32_t)number + SDADC_ADC_CTL_0_RST_AN_ADCN_SHIFT)));
        }
    }
}

/*!
 * @brief This function is used to reset or release reset for the SDADC channeln's P-Side or/and N-Side decimator.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param type channel type, refer @ref sdadc_channel_type_t for details.
 * @param reset Indicates reset or release reset for the decimator.
 * - @b true Reset
 * - @b false Release reset
 */
static inline void SDADC_ControlDecimatorReset(SDADC_Type *base,
                                               sdadc_channel_number_t number,
                                               sdadc_channel_type_t type,
                                               bool reset)
{
    if (reset)
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->DECIMATOR_CTL_1 &=
                ~(0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_P_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->DECIMATOR_CTL_1 &=
                ~(0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_N_SHIFT));
        }
        else
        {
            base->DECIMATOR_CTL_1 &=
                ~((0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_P_SHIFT)) |
                  (0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_N_SHIFT)));
        }
    }
    else
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->DECIMATOR_CTL_1 |=
                (0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_P_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->DECIMATOR_CTL_1 |=
                (0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_N_SHIFT));
        }
        else
        {
            base->DECIMATOR_CTL_1 |=
                ((0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_P_SHIFT)) |
                 (0x1UL << ((uint32_t)number + SDADC_DECIMATOR_CTL_1_FUNC_LOCAL_RST_AN_DEC_N_SHIFT)));
        }
    }
}

/*!
 * @brief This function is used to reset or release reset for the SDADC channeln's P-Side or/and N-Side madulator DC
 * Loop.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param type channel type, refer @ref sdadc_channel_type_t for details.
 * @param reset Indicates whether reset or release reset for the madulator DC Loop.
 * - @b true Reset
 * - @b false Release reset
 */
static inline void SDADC_ConfigureModulatorDcLoopReset(SDADC_Type *base,
                                                       sdadc_channel_number_t number,
                                                       sdadc_channel_type_t type,
                                                       bool reset)
{
    if (reset)
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->DC_LOOP_CTL_1 &=
                ~(0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_P_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->DC_LOOP_CTL_1 &=
                ~(0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_N_SHIFT));
        }
        else
        {
            base->DC_LOOP_CTL_1 &=
                ~((0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_P_SHIFT)) |
                  (0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_N_SHIFT)));
        }
    }
    else
    {
        if (type == kSDADC_Channel_PSide_Type)
        {
            base->DC_LOOP_CTL_1 |= (0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_P_SHIFT));
        }
        else if (type == kSDADC_Channel_NSide_Type)
        {
            base->DC_LOOP_CTL_1 |= (0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_N_SHIFT));
        }
        else
        {
            base->DC_LOOP_CTL_1 |=
                ((0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_P_SHIFT)) |
                 (0x1UL << ((uint32_t)number + SDADC_DC_LOOP_CTL_1_FUNC_LOCAL_RST_AN_DCLOOP_N_SHIFT)));
        }
    }
}
/*!
 * @}
 */

/*!
 * @name SDADC FIFO related operations.
 * @{
 */
/*!
 * @brief This function is used to enable or disable the global FIFO full interrupt.
 *
 * @param base SDADC peripheral base address.
 * @param enable Indicates whether enable or disable the global FIFO full interrupt.
 * - @b true Enable interrupt
 * - @b false Disable interrupt
 */
static inline void SDADC_ControlGlobalFifoIntEnable(SDADC_Type *base, bool enable)
{
    if (enable)
    {
        base->FIFO_INTERRUPT |= SDADC_FIFO_INTERRUPT_FIFO_INTERRUPT_EN_MASK;
    }
    else
    {
        base->FIFO_INTERRUPT &= ~SDADC_FIFO_INTERRUPT_FIFO_INTERRUPT_EN_MASK;
    }
}

/*!
 * @brief This function is used to check whether the FIFO full interrupt has occurred.
 *
 * @param base SDADC peripheral base address.
 *
 * @return The FIFO full interrupt status flag.
 * - @b true The FIFO full interrupt has occurred.
 * - @b false The FIFO full interrupt has not occurred.
 */
static inline bool SDADC_CheckGlobalFifoInterrupted(SDADC_Type *base)
{
    return (0UL != ((base->FIFO_INTERRUPT & SDADC_FIFO_INTERRUPT_FIFO_INTERRUPT_MASK) >>
                    SDADC_FIFO_INTERRUPT_FIFO_INTERRUPT_SHIFT));
}

/*!
 * @brief This function is used to clear the FIFO full interrupt status flag.
 *
 * @param base SDADC peripheral base address.
 */
static inline void SDADC_ClearGlobalFifoIntStatusFlag(SDADC_Type *base)
{
    base->FIFO_INTERRUPT |= SDADC_FIFO_INTERRUPT_FIFO_INTERRUPT_MASK;
}

/*!
 * @brief This function is used to enable or disable the FIFO full interrupt.
 *
 * @param base SDADC peripheral base address.
 * @param mask Mask value to enable or disable interrupt, please refer to @ref _sdadc_fifo_int_enable for details.
 * @param enable Indicates enable or disable the FIFO full interrupt.
 * - @b true Enable interrupt
 * - @b false Disable interrupt
 */
static inline void SDADC_ControlFifoIntEnable(SDADC_Type *base, uint32_t mask, bool enable)
{
    if (enable)
    {
        base->FIFO_WATERMARK_ERROR_CTL |= mask;
    }
    else
    {
        base->FIFO_WATERMARK_ERROR_CTL &= ~mask;
    }
}

/*!
 * @brief This function is used to enable or disable the FIFO watermark.
 *
 * @param base SDADC peripheral base address.
 * @param mask Mask value to enable or disable watermark, please refer to @ref _sdadc_fifo_watermark_enable for details.
 * @param enable Indicates enable or disable the FIFO watermark.
 * - @b true Enable watermark
 * - @b false Disable watermark
 */
static inline void SDADC_ControlFifoWatermarkEnable(SDADC_Type *base, uint32_t mask, bool enable)
{
    if (enable)
    {
        base->FIFO_WATERMARK_ERROR_CTL |= mask;
    }
    else
    {
        base->FIFO_WATERMARK_ERROR_CTL &= ~mask;
    }
}

/*!
 * @brief This function is used to get the FIFO full interrupt status flags.
 *
 * @param base SDADC peripheral base address.
 *
 * @return Status flags of the FIFO full interrupt.
 */
static inline uint8_t SDADC_GetFifoIntStatusFlags(SDADC_Type *base)
{
    return (uint8_t)((base->FIFO_WATERMARK_ERROR_ST & SDADC_FIFO_FULL_INT_STATUS_MASK) >>
                     SDADC_FIFO_FULL_INT_STATUS_SHIFT);
}

/*!
 * @brief This function is used to get the FIFO watermark status flags.
 *
 * @param base SDADC peripheral base address.
 *
 * @return Status flags of the FIFO watermark.
 */
static inline uint8_t SDADC_GetFifoWatermarkStatusFlags(SDADC_Type *base)
{
    return (uint8_t)((base->FIFO_WATERMARK_ERROR_ST & SDADC_FIFO_WATERMARK_STATUS_MASK) >>
                     SDADC_FIFO_WATERMARK_STATUS_SHIFT);
}

/*!
 * @brief This function is used to configure FIFO watermark.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param type channel type, refer @ref sdadc_channel_type_t for details.
 * @param waterMark WaterMark value, see @ref sdadc_watermark_t for details.
 */
static inline void SDADC_ConfigureFifoWatermark(SDADC_Type *base,
                                                sdadc_channel_number_t number,
                                                sdadc_channel_type_t type,
                                                sdadc_watermark_t waterMark)
{
    if (type == kSDADC_Channel_PSide_Type)
    {
        base->FIFO_WATERMARK_CTL = ((base->FIFO_WATERMARK_CTL & (~SDADC_FIFO_WATERMARK_CTL_P_MASK(number))) |
                                    SDADC_FIFO_WATERMARK_CTL_P(waterMark.pSideWatermark, number));
    }
    else if (type == kSDADC_Channel_NSide_Type)
    {
        base->FIFO_WATERMARK_CTL = ((base->FIFO_WATERMARK_CTL & (~SDADC_FIFO_WATERMARK_CTL_N_MASK(number))) |
                                    SDADC_FIFO_WATERMARK_CTL_N(waterMark.nSideWatermark, number));
    }
    else
    {
        base->FIFO_WATERMARK_CTL =
            ((base->FIFO_WATERMARK_CTL &
              (~(SDADC_FIFO_WATERMARK_CTL_P_MASK(number) | SDADC_FIFO_WATERMARK_CTL_N_MASK(number)))) |
             (SDADC_FIFO_WATERMARK_CTL_P(waterMark.pSideWatermark, number) |
              SDADC_FIFO_WATERMARK_CTL_N(waterMark.nSideWatermark, number)));
    }
}

/*!
 * @brief This function is used to reset the specific channel side FIFO's read or/and write pointer.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param type channel type, refer @ref sdadc_channel_type_t for details.
 * @param operation Indicates which reset operation to do, refer @ref sdadc_fifo_reset_operation_t for details.
 */
static inline void SDADC_ControlFifoReadWriteReset(SDADC_Type *base,
                                                   sdadc_channel_number_t number,
                                                   sdadc_channel_type_t type,
                                                   sdadc_fifo_reset_operation_t operation)
{
    if (type == kSDADC_Channel_PSide_Type)
    {
        base->FIFO_WR_RD_CTL |=
            ((uint32_t)operation << (((uint32_t)number * 4U) + SDADC_FIFO_WR_RD_CTL_WR_0_P_RST_SHIFT));
    }
    else if (type == kSDADC_Channel_NSide_Type)
    {
        base->FIFO_WR_RD_CTL |=
            ((uint32_t)operation << (((uint32_t)number * 4U) + SDADC_FIFO_WR_RD_CTL_WR_0_N_RST_SHIFT));
    }
    else
    {
        base->FIFO_WR_RD_CTL |=
            (((uint32_t)operation << (((uint32_t)number * 4U) + SDADC_FIFO_WR_RD_CTL_WR_0_P_RST_SHIFT)) |
             ((uint32_t)operation << (((uint32_t)number * 4U) + SDADC_FIFO_WR_RD_CTL_WR_0_N_RST_SHIFT)));
    }
}

/*!
 * @brief This function is used to get the specific channel side FIFO's available entries.
 *
 * @note In the differential mode, the bit stream is converted to 24bit data (FIFO_x_P[23:0]) by the P-Side decimator,
 * the output of N-Side decimator (FIFO_x_N[23:0]) is not valid.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param type channel type, refer @ref sdadc_channel_type_t for details.
 *
 * @return The available entries of the specified FIFO, note that only the lower 5 bits of the returned data are valid.
 */
static inline uint8_t SDADC_GetConvChannelFifoAvailableEntries(SDADC_Type *base,
                                                               sdadc_channel_number_t number,
                                                               sdadc_channel_type_t type)
{
    uint8_t registerOffset = (uint32_t)number / 2U;
    uint8_t bitfieldOffset = (uint32_t)number % 2U * 16U;
    uint8_t temp           = 0U;

