solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/drivers/fsl_sdadc.h
    if (type == kSDADC_Channel_PSide_Type)
    {
        temp = (uint8_t)(uint32_t)(((*(((volatile uint32_t *)(&(base->FIFO_ENTRIES_AVAIL_0))) + registerOffset)) >> bitfieldOffset) & 
                                   SDADC_FIFO_ENTRIES_AVAIL_MASK);
    }
    else if (type == kSDADC_Channel_NSide_Type)
    {
        temp = (uint8_t)(uint32_t)(((*(((volatile uint32_t *)(&(base->FIFO_ENTRIES_AVAIL_0))) + registerOffset)) >> (bitfieldOffset + 8U)) & 
                                   SDADC_FIFO_ENTRIES_AVAIL_MASK);
    }
    else
    {
        /* Empty branch to avoid MISRA C-2012 issue. */
    }

    return temp;
}

/*!
 * @brief This function is used to get the specific channel side FIFO's raw data.
 *
 * @note In the differential mode, the bit stream is converted to 24bit data (FIFO_x_P[23:0]) by the P-Side decimator,
 * the output of N-Side decimator (FIFO_x_N[23:0]) is not valid. So the type that needs to be passed in in differential
 * mode is @ref kSDADC_Channel_PSide_Type.
 *
 * @param base SDADC peripheral base address.
 * @param number channel number, refer @ref sdadc_channel_number_t for details.
 * @param type channel type, refer @ref sdadc_channel_type_t for details.
 *
 * @return The raw data of the specified FIFO.
 */
static inline uint32_t SDADC_GetConvChannelFifoRawData(SDADC_Type *base,
                                                       sdadc_channel_number_t number,
                                                       sdadc_channel_type_t type)
{
    uint8_t offset = 0U;

    if (type == kSDADC_Channel_PSide_Type)
    {
        offset = (uint32_t)number * 2U;
    }
    else if (type == kSDADC_Channel_NSide_Type)
    {
        offset = (uint32_t)number * 2U + 1U;
    }
    else
    {
        assert(false);
    }

    return (((*(((volatile uint32_t *)(&(base->FIFO_0_P))) + offset)) & SDADC_FIFO_MASK) >> SDADC_FIFO_SHIFT);
}

/*!
 * @brief This function is used to copy specific conversion channels' data from FIFO to buffer.
 *
 * @note This function will copy all 16 entries in the specified FIFO.
 *
 * @param base SDADC peripheral base address.
 * @param group Indicates which group of channels data to obtain.
 * @param count Indicates how many channels in the specified group.
 * @param buffer The buffer which stores conversion data.
 */
void SDADC_CopyConvChannelFifoToBuffer(SDADC_Type *base, sdadc_channel_group *group, uint8_t count, void *buffer);
/*!
 * @}
 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */

#endif /* FSL_SDADC_H_ */
